Revit 2027 API
BuiltInFailures.SlantedColumnFailures.SlantedColumnCannotCutEndWarn Property
 Unable to trim slanted column end geometry to desired condition.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SlantedColumnCannotCutEndWarn { get; }
Public Shared ReadOnly Property SlantedColumnCannotCutEndWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SlantedColumnCannotCutEndWarn {
	FailureDefinitionId^ get ();
}
static member SlantedColumnCannotCutEndWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SlantedColumnFailures Class
Autodesk.Revit.DB Namespace